In [1]:
! pip3 show sqlalchemy | grep Version

Version: 2.0.28
Location: /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages

In [2]:
! pip3 install --upgrade sqlalchemy

Requirement already satisfied: sqlalchemy in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (2.0.28)
Requirement already satisfied: typing-extensions>=4.6.0 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from sqlalchemy) (4.10.0)

In [22]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
password = getpass.getpass()

In [23]:
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [24]:
from sqlalchemy import text

with engine.connect() as connection:
    query = text('SELECT * FROM payment')
    result = connection.execute(query)

In [54]:
def rentals_month(engine, month, year):
    sql = f"""
    select * 
    from sakila.rental
    where year(rental_date) = {year} and
    month(rental_date) ={month}"""
    df1= pd.read_sql_query(sql, engine)
    return  df1

df1 = rentals_month(engine,6,2005)
df1

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
2306,3465,2005-06-21 22:10:01,1488,510,2005-06-30 21:35:01,1,2006-02-15 21:30:53
2307,3466,2005-06-21 22:13:33,371,226,2005-06-25 21:01:33,2,2006-02-15 21:30:53
2308,3467,2005-06-21 22:19:25,729,543,2005-06-27 00:03:25,2,2006-02-15 21:30:53
2309,3468,2005-06-21 22:43:45,2899,100,2005-06-30 01:49:45,1,2006-02-15 21:30:53
2310,3469,2005-06-21 22:48:59,4087,181,2005-06-28 19:32:59,1,2006-02-15 21:30:53

In [ ]:
def get_AB_loans(connection):
    with engine.connect() as connection:
        # Getting how many loans were granted every year, and the month of each duration.
        txt = '''select year(date) as 'Year', month(date) as 'Month', duration, count(loan_id) as 'New_loans' from bank.loan
                group by Year, Month, duration
                order by Year, Month, duration;'''
        query = text(txt)
        result = connection.execute(query)
        df1=pd.DataFrame(result.all())
    return pd.DataFrame(result.all())

In [ ]:
# Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month 
#and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

# The function should also include the month and year as parameters and use them to name the new column according to the month and year,
# for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

# Hint: Consider making use of pandas groupby()

In [143]:
def rental_count_month(rentals_month, engine, month, year):
    df2=rentals_month(engine, month, year)
    series=df2['customer_id'].value_counts()
    df3 = pd.DataFrame(series).reset_index()

    df4=df3.rename(columns={"count":f'rentals_{month}_{year}'})


    return df4

df5= rental_count_month(rentals_month, engine, 5, 2005)

df5

     customer_id  rentals_5_2005
0            197               8
1            109               7
2            506               7
3            371               6
4            161               6
..           ...             ...
515          590               1
516          537               1
517          426               1
518          494               1
519           61               1

[520 rows x 2 columns]

In [ ]:
#Create a Python function called `compare_rentals` that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. 
# The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [146]:
def rental_count_month(rentals_month, engine, month, year):
    df2=rentals_month(engine, month, year)
    series=df2['customer_id'].value_counts()
    df3 = pd.DataFrame(series).reset_index()
    #rename column as per instruction (it also helps to merge dfs in the next task)
    df4=df3.rename(columns={"count":f'rentals_{month}_{year}'})


    return df4

month_a = 5
year_a = 2005
month_b = 6
year_b = 2005

dfA= rental_count_month(rentals_month, engine, month_a, year_a)
dfB= rental_count_month(rentals_month, engine, month_b, year_b)

In [147]:
def compare_rentals(dfA,dfB):
    df_compare = pd.merge(dfA,dfB, how="left", on="customer_id") 
    
    # fill NAs to be able to compare months with no rentals

    df_compare.iloc[:, 2]= df_compare.iloc[:, 2].fillna(0)
    df_compare.iloc[:, 1]=df_compare.iloc[:, 1].fillna(0)
    
    df_compare[f'difference (rentals {month_b}_{year_b} - {month_a}_{year_a})'] = df_compare.iloc[:, 2].sub(df_compare.iloc[:, 1])
    


    
    return df_compare

df_final = compare_rentals(dfA,dfB)
df_final

,customer_id,rentals_5_2005,rentals_6_2005,difference (rentals 6_2005 - 5_2005)
0,197,8,8.0,0.0
1,109,7,5.0,-2.0
2,506,7,5.0,-2.0
3,371,6,7.0,1.0
4,161,6,2.0,-4.0
...,...,...,...,...
515,590,1,5.0,4.0
516,537,1,4.0,3.0
517,426,1,5.0,4.0
518,494,1,1.0,0.0
519,61,1,0.0,-1.0